use Lab9;

Select [Название категории], [Название товара], Max([Вес товара]) as 'Максимальный вес'
from [Товар]
			join Категория on Товар.[ID Категории] = Категория.[ID Категории]
			
			group by [Название товара], [Название категории]
			having Max([Вес товара]) < 500


Select [ФИО], [Дата Продажи], Min([Количество]) as 'Количество', [Цена продажи]
from [Покупатель]
				join [Продажи] on [Покупатель].[№ Покупателя]=[Продажи].[№ Покупателя]

				group by [ФИО], [Дата Продажи], [Цена продажи]
				having Min([Количество]) = 1200


select Avg([Цена]) as 'Средняя цена', [Название склада],[Название товара], [Вес товара], [Название категории]
from [Склад]
            join [Товар] on [Склад].[ID Склада]=[Товар].[ID Склада]
			join [Категория] on Категория.[ID Категории] = Товар.[ID Категории]

			Group by [Название склада],[Название товара], [Вес товара], [Название категории]
			having Avg([Цена]) < 20


select [Название товара], Min(Цена) as 'Минимальная цена'
from Товар
		join Поставка on Поставка.[№ товара] = Товар.[№ товара]

		group by [Название товара]
		having Min([Цена]) = 7

select ФИО, Min([Цена продажи]) as 'Минимальная цена'
from Продажи
			join Покупатель on Покупатель.[№ Покупателя] = Продажи.[№ Покупателя]

			group by ФИО

select Наименование, Телефон, Max(Количество) as 'Максимальное количество'
from Поставка
			join Поставщик on Поставщик.[ID Поставщика] = Поставка.[ID Поставщика]

			group by Наименование, Телефон

select [Название товара], Avg([Вес товара]) as 'Средний вес'
from Товар
		join Поставка on Поставка.[№ товара] = Товар.[№ товара]

		group by [Название товара]

Select [Название склада],[Название товара], Max([Вес товара]) as 'Минимальный вес', [Название категории], Продажи.Количество [Дата Продажи], [Цена продажи], ФИО, Поставка.Количество, [Дата Поставки], Наименование, Телефон
from [Склад]
			join [Товар] on [Склад].[ID Склада]=[Товар].[ID Склада]
			join [Категория] on Категория.[ID Категории] = Товар.[ID Категории]
			join [Продажи] on Товар.[№ товара] = Продажи.[№ товара]
			join [Покупатель] on Продажи.[№ Покупателя] = Покупатель.[№ Покупателя]
			join [Поставка] on Товар.[№ товара] = Поставка.[№ товара]
			join [Поставщик] on Поставка.[ID Поставщика] = Поставщик.[ID Поставщика]

			group by [Название склада],[Название товара], [Название категории], Продажи.Количество, [Дата Продажи], [Цена продажи], ФИО, Поставка.Количество, [Дата Поставки], Наименование, Телефон
			
			having Max([Вес товара]) = 700
