use Lab9;

Select [Название склада],[Название товара], [Вес товара]
from [Склад]
            join [Товар] on [Склад].[ID Склада]=[Товар].[ID Склада]

			where [Вес товара] <= 500 


Select [ФИО], [Дата Продажи], [Количество], [Цена продажи]
from [Покупатель]
				join [Продажи] on [Покупатель].[№ Покупателя]=[Продажи].[№ Покупателя]

				ORDER BY [Дата Продажи]


Select Наименование, Телефон, Количество, [Дата Поставки],[Название товара], [Вес товара]
from [Поставщик]
				join [Поставка] on [Поставщик].[ID Поставщика]=Поставка.[ID Поставщика]
				join [Товар] on [Поставка].[№ товара] = Товар.[№ товара]

				where [Название товара] like 'З%'


Select [Название склада],[Название товара], [Вес товара], [Название категории]
from [Склад]
            join [Товар] on [Склад].[ID Склада]=[Товар].[ID Склада]
			join [Категория] on Категория.[ID Категории] = Товар.[ID Категории]

			WHERE [Вес товара] NOT BETWEEN 700 AND 1000
			ORDER BY [Название категории]

Select [Название склада],[Название товара], [Вес товара], [Название категории], Продажи.Количество [Дата Продажи], [Цена продажи], ФИО, Поставка.Количество, [Дата Поставки], Наименование, Телефон
from [Склад]
			join [Товар] on [Склад].[ID Склада]=[Товар].[ID Склада]
			join [Категория] on Категория.[ID Категории] = Товар.[ID Категории]
			join [Продажи] on Товар.[№ товара] = Продажи.[№ товара]
			join [Покупатель] on Продажи.[№ Покупателя] = Покупатель.[№ Покупателя]
			join [Поставка] on Товар.[№ товара] = Поставка.[№ товара]
			join [Поставщик] on Поставка.[ID Поставщика] = Поставщик.[ID Поставщика]

			ORDER BY [Название товара]
